var data = {
	"grammar": [
		{
			"id": "N4-04",
			"name": "によると", 
			"translation": "根據、依據",
			"level": "N4",
			"usage": [
				{
					"structure": "名詞 + によると",
					"explanation": "表示消息或傳言之出處（消息來源），中譯多為「根據、依據」。文末常以「そうだ」、「ということだ」、「とのことだ」、「んだって」相呼應。",
					"example": [
						{
							"sentence": "天気予報によると、来週台風が来るそうだ。",
							"translation": "根據氣象預報，下周有颱風會來。"
						},
						{
							"sentence": "新聞によると、その交通事故では3人が負傷したそうだ。",
							"translation": "看了報紙，據說此次交通意外有三人受傷。"
						},
						{
							"sentence": "警察の発表によると、15 人が死亡したということだ。",
							"translation": "警方表示有15人死亡。"
						}
					],
					"note": [
						"這邊的「そうだ」是傳聞用法，而非樣態。因此文法為「連體形+そうだ」。",
						"注意消息來源的用法。「Ｘによると」的「Ｘ」是消息的來源，如果只有寫人物會不太自然，應再加上「発表、話、説明」等，表示來源的出處。"
					]
				}
			]
		},
		{
			"id": "N4-31",
			"name": " (よ)うとする・思う", 
			"translation": "表示意志",
			"level": "N4",
			"usage": [
				{
					"structure": "V(意量形) + (よ)う",
					"explanation": "表示「意志、推量、勸誘」等，中文上多譯為「～吧」",
					"example": [
						{
							"sentence": "行こう。",
							"translation": "走吧。"
						},
						{
							"sentence": "早く帰ろう。",
							"translation": "趕快回去吧。"
						},
						{
							"sentence": "食べよう。",
							"translation": "吃吧。"
						}
					]
				},
				{
					"structure": "V(意量形) + (よ)うとする",
					"explanation": "表動作正要發生之前的狀態，譯為「就要~、正想~、正準備要~」。經常和「と」「とき」「ところ」搭配。",
					"example": [
						{
							"sentence": "言おうとすると、忘れてしまいました。",
							"translation": "正要說就忘了。"
						},
						{
							"sentence": "出かけようとしたとき、友達が来ました。",
							"translation": "正要出門時朋友就來了。"
						},
						{
							"sentence": "勉強しようとすると眠くなる。",
							"translation": "要來念書的時候就變得想睡覺了。"
						},
						{
							"sentence": "寝ようとしたところに、電話がかかってきた。",
							"translation": "正要睡時電話響了。"
						}
					]
				},
				{
					"structure": "V(意量形) + (よ)うと思う",
					"explanation": "表打算做某動作，譯為「打算、想」",
					"example": [
						{
							"sentence": "日本に留学しようと思っています。",
							"translation": "我打算去日本留學。"
						},
						{
							"sentence": "今日からダイエットしようと思います。",
							"translation": "我打算從今天開始減肥。"
						},
						{
							"sentence": "彼は会社を辞めようと思っています。",
							"translation": "他打算離職。"
						}
					]
				}
			]
		},
		{
			"id": "N4-43",
			"name": "ようにする・ようになる", 
			"translation": "表示意志或推測",
			"level": "N4",
			"usage": [
				{
					"structure": "V4 + ようにする",
					"explanation": "為了達到前項內容而努力，是一種下決心要培養的習慣。",
					"example": [
						{
							"sentence": "今日から野菜も食べるようにする。",
							"translation": "從今天開始也吃青菜。"
						},
						{
							"sentence": "毎日、日本語のＴＶ番組を見るようにする。",
							"translation": "每天都要看日語的電視節目。"
						},
						{
							"sentence": "エレベーターがあっても、できるだけ階段を使うようにする。",
							"translation": "即使有電梯也盡可能走樓梯。"
						}
					],
					"note": [
						"如果是已經在進行的長期習慣則使用「V4 + ようにしている」的形式。"
					]
				},
				{
					"structure": "V4 + ようになる",
					"explanation": "表示動作上習慣性的自然演變，多為無能力到有能力的轉換表現。",
					"example": [
						{
							"sentence": "一歳を過ぎたので、もうすぐ歩けるようになるでしょう。",
							"translation": "已經一歲了，應該很快就會走路了吧？"
						},
						{
							"sentence": "爺ちゃんもやっとパソコンが使えるようになった。",
							"translation": "爺爺終於也會用電腦了。"
						},
						{
							"sentence": "毎日練習すれば、すぐに自転車に乗れるようになるでしょう。",
							"translation": "每天練習的話，很快就會騎腳踏車了吧。"
						}
					]
				}
			]
		},
		{
			"id": "N3-01",
			"name": "あがる／あげる", 
			"translation": "徹底完成",
			"level": "N3",
			"usage": [
				{
					"structure": "V2 + あがる 【自動詞】",
					"explanation": "表示某動作已經徹底完成了。由於是自動詞，所以是指物品已經完成的狀態。",
					"example": [
						{
							"sentence": "ピザが焼きあがりました。",
							"translation": "披薩烤好了。(自動詞)"
						},
						{
							"sentence": "洋服が仕上がりました。",
							"translation": "洋裝完成了。(自動詞)"
						},
						{
							"sentence": "原稿が書きあがりました。",
							"translation": "原稿寫好了。(自動詞)"
						}
					],
					"note": [
						"另外如果有注意到雨停的日文，常見的有「雨が止む」和「雨が上がる」，「雨が止んだ」是單純說雨停了，也許等等還會下(不知道)，但如果說「雨が上がった」就表示雨完全(徹底)停止了，已經是放晴的狀態。"
					]
				},
				{
					"structure": "V2 + あげる 【他動詞】",
					"explanation": "表示徹底完成某動作。由於是他動詞，所以是指某人已經完成的動作。",
					"example": [
						{
							"sentence": "ピザを焼きあげました。",
							"translation": "烤好披薩了。(他動詞)"
						},
						{
							"sentence": "洋服を仕上げました。",
							"translation": "完成洋裝了。(他動詞)"
						},
						{
							"sentence": "原稿を書きあげました。",
							"translation": "寫好原稿了。(他動詞)"
						}
					]
				}
			],
			"note": [
				"「あがる／あげる」具有徹底完成的意思，所以當烤好披薩時，講「焼きあがりました」會比「焼きました」更有完成的感覺。",
				"「V2あがる」、「V2あげる」可以寫作漢字的「V2上がる」、「V2上げる」。",
				"「仕上がる」、「出来上がる」、「完成する」等有微妙的差別，請參考此篇：「出来上がる」和「仕上げる」的差別"
			]
		},
		{
			"id": "N3-02",
			"name": "一方(だ)", 
			"translation": "不斷地",
			"level": "N3",
			"usage": [
				{
					"structure": "V4 (辭書形) + 一方(いっぽう)",
					"explanation": "表示事物朝某個方向持續發展，有傾向的意思，可用於正面或負面事物，但以負面消極例子居多。中譯為「不斷地~」、「越來越~」。",
					"example": [
						{
							"sentence": "スマホを使う人の数は増える一方だ。",
							"translation": "使用智慧型手機的人數不斷地增加。"
						},
						{
							"sentence": "原油価格は上がる一方だ。",
							"translation": "原油價格不斷地上漲。"
						},
						{
							"sentence": "国の国際競争力は低下する一方だ。",
							"translation": "國家的國際競爭力越來越低落。"
						}
					],
					"note": [
						"「～一方だ」≒「だんだん～ていく」≒「～ばかりだ」",
						"「一方」是名詞，後面接「だ」或「です」，如果是作為主語，其變化與形容動詞相同，如「低下する一方なのは問題です。」（持續低落是一個問題。）"
					]
				}
			]
		},
		{
			"id": "N3-03",
			"name": "うちに", 
			"translation": "在~過程中／趁~",
			"level": "N3",
			"usage": [
				{
					"structure": "V4／Vている／A4／NA4／(N+の) + うちに",
					"explanation": "表示在某個期間或時間內的持續狀態中，做了後項的動作。多譯為「在~之中、期間、過程中~」等。",
					"example": [
						{
							"sentence": "日本を旅するうちに、日本語を覚えた。",
							"translation": "在旅日期間學會了日語。"
						},
						{
							"sentence": "授業を聞いているうちに、眠ってしまった。",
							"translation": "上課上到一半不小心睡著了。"
						},
						{
							"sentence": "若いうちにいろんなことを経験しました。",
							"translation": "我在年輕時體驗過各種事情。"
						},
						{
							"sentence": "親が元気なうちに遺言書を書いてもらった。",
							"translation": "父母還健在時，我請他們先寫好遺書。"
						},
						{
							"sentence": "メイデイのコンサートは現地のファン５万人の歓声の中、大盛況のうちに終わった。",
							"translation": "五月天的演唱會在現場5萬人的歡呼聲中，盛大落幕。"
						}
					],
					"note": [
						"例句①的「旅する(たびする)」等同於「旅行する(りょこうする)」。「覚える」是「記得、學會」，它具有掌握、記憶的意思，多半屬於身體感受、或心裡感受所學到的事情，因此在日本旅遊過程中領會日語，就可以用「覚えた」。",
						"當前項為「ている」形式時，後面發生的動作多半是自然發生，而非自我意識。"
					]
				},
				{
					"structure": "V4／Vている／A4／NA4／(N+の) + うちに(趁~)",
					"explanation": "當句子非過去式時，「うちに」多半指「趁~之內」的意思。「~ないうちに」就是「趁還沒~的時候」之意。",
					"example": [
						{
							"sentence": "若いうちにいろんなことを経験したほうがいい。",
							"translation": "要趁年輕多體驗各種事情。"
						},
						{
							"sentence": "冷めないうちに食べてください。",
							"translation": "趁還沒冷掉趕快吃。"
						},
						{
							"sentence": "空模様が怪しくなってきたので、雨が降らないうちに、洗濯物を取り込もう。",
							"translation": "天空看起來快要下雨，趁下雨之前，趕快把洗好的衣服收進來吧。"
						}
					],
					"note": [
						"當「うちに」用於「趁~之內」的情況時，具有「把握短時間」的語感，因此時間長度比「あいだ」更短。「怪しい」原本是奇怪的意思，在這句「空模様が怪しい」則是指「天氣轉陰快要下雨」的意思。"
					]
				},
				{
					"structure": "V4／Vている／A4／NA4／(N+の) + うちは",
					"explanation": "「うちに」是具有限定的期間，有「趁~之內」完成之意。「うちは」只是提出該期間作為主詞，其動作可以為多次性，並沒有「趁~」的意思。",
					"example": [
						{
							"sentence": "雨が降らないうちに、早く帰ったほうがいい。",
							"translation": "趁還沒下雨趕快回家比較好。"
						},
						{
							"sentence": "雨が降っているうちは、ずっと勉強しています。",
							"translation": "在下雨的這段時間內，我一直在看書。"
						}
					]
				}
			]
		},
		{
			"id": "N3-04",
			"name": "おかげで", 
			"translation": "多虧、幸虧",
			"level": "N3",
			"usage": [
				{
					"structure": "(Vた／A4／NA4／N+の)+おかげで",
					"explanation": "表示承蒙前項恩惠才有後項的好結果，語氣中帶有感謝之意，中譯為「多虧、幸虧」。此用法亦可用在負面事物上，帶有諷刺意味，如「拜某人所賜才有此惡果」。「おかげで」的「で」具有原因理由之意，若放置句尾時則用「です／だ」即可。另外還有一個常見的詞彙：「お陰様で（おかげさまで）」，中文為「托您的福」。",
					"example": [
						{
							"sentence": "このサイトを続けられたのは、みんなが応援してくれたおかげです。",
							"translation": "多虧大家的支持這個網站才能持續下去。"
						},
						{
							"sentence": "競争相手が少ないおかげで、勝てる確率が高くなる。",
							"translation": "幸虧競爭對手很少才讓勝率提高。"
						},
						{
							"sentence": "家にいる20歳の猫は、体が丈夫なおかげで、寒い雪の夜を無事に過ごすことができた。",
							"translation": "家裡20歲的貓幸虧身體勇健才能在寒冷的雪夜裡平安度過。"
						},
						{
							"sentence": "薬のおかげで8時間眠れるようになりました。",
							"translation": "多虧藥效讓我能睡足8個小時了。"
						},
						{
							"sentence": "お陰様で、元気です。",
							"translation": "托您的福，我很好。"
						}
					]
				}
			]
		},
		{
			"id": "N3-05",
			"name": "恐れがある", 
			"translation": "恐怕、恐有",
			"level": "N3",
			"usage": [
				{
					"structure": "（V4／N + の）おそれがある",
					"explanation": "表示推測可能會發生不好的事情，只用於負面推測，多用於新聞播報。中譯為「恐怕」、「有~的危險」。相當於「危険がある」。",
					"example": [
						{
							"sentence": "治療が遅れると感染を広げる恐れがある。",
							"translation": "若延遲治療恐怕感染會擴大。"
						},
						{
							"sentence": "このまま雪が続けば、住民の生活に大きな影響が出る恐れがある。",
							"translation": "若再這樣持續下雪的話，恐怕會對住民的生活造成很大的影響。"
						},
						{
							"sentence": "交通省は震度５強の地震で倒壊の恐れがある建物が1400棟に上がることを明らかにした。",
							"translation": "交通部表明可能受五級地震倒塌的建築物高達1400棟。"
						},
						{
							"sentence": "台風や大雨などによる災害の恐れがある。",
							"translation": "恐因颱風或大雨造成災害。"
						}
					]
				}
			]
		},
		{
			"id": "N3-70",
			"name": "とたん（に）", 
			"translation": "剎那、瞬間",
			"level": "N3",
			"usage": [
				{
					"structure": "V2 + た + とたん（に）",
					"explanation": "用於動詞過去式，表示某動作發生後的瞬間緊接著發生後面的動作，多帶有意外性。漢字為「途端（とたん）」，後面的「に」可省略，中譯多為「剎那」、「瞬間」、「一~就~」等。",
					"example": [
						{
							"sentence": "電気が切れたとたんに、幽霊が現れた。",
							"translation": "電燈熄滅的剎那，鬼就出現了。"
						},
						{
							"sentence": "テレビをつけたとたん、停電になった",
							"translation": "打開電視的一剎那突然停電了。"
						},
						{
							"sentence": "家を出たとたん、私のバイクの上に野良猫が寝ている姿を見た。",
							"translation": "一出家門就看到一隻流浪貓在我機車上睡覺。"
						}
					],
					"note": [
						"「とたん」表示前項動作與後項動作（或發現）幾乎是同時發生，也就是說前項動作發生的極短瞬間內馬上發生後項動作（或發現後項事情）。",
						"「とたん」一般不用於說話者的意志動作上。由於「とたん」多半帶有意外性，而說話者的意志動作屬於自己的意志（也就是說自己要做的動作不會有意外性），因此不太會用「とたん」，意志動作多半用「～と+すぐに」來表達。"
					]
				}
			]
		}
	]
}