var data = {
	"grammar": [
		{
			"id": "N4-04",
			"name": "によると", 
			"translation": "根據、依據",
			"level": "N4",
			"usage": [
				{
					"structure": "名詞 + によると",
					"explanation": "表示消息或傳言之出處（消息來源），中譯多為「根據、依據」。文末常以「そうだ」、「ということだ」、「とのことだ」、「んだって」相呼應。",
					"example": [
						{
							"sentence": "天気予報によると、来週台風が来るそうだ。",
							"translation": "根據氣象預報，下周有颱風會來。"
						},
						{
							"sentence": "新聞によると、その交通事故では3人が負傷したそうだ。",
							"translation": "看了報紙，據說此次交通意外有三人受傷。"
						},
						{
							"sentence": "警察の発表によると、15 人が死亡したということだ。",
							"translation": "警方表示有15人死亡。"
						}
					],
					"note": [
						"這邊的「そうだ」是傳聞用法，而非樣態。因此文法為「連體形+そうだ」。",
						"注意消息來源的用法。「Ｘによると」的「Ｘ」是消息的來源，如果只有寫人物會不太自然，應再加上「発表、話、説明」等，表示來源的出處。"
					]
				}
			]
		},
		{
			"id": "N4-19",
			"name": "てしまう", 
			"translation": "補助動詞",
			"level": "N4",
			"usage": [
				{
					"structure": "て形 + しまう",
					"explanation": "表動作的完了、盡了、光了",
					"example": [
						{
							"sentence": "彼女の作った料理を食べてしまいました。",
							"translation": "把女朋友做的料理吃光光了。"
						},
						{
							"sentence": "彼はもう行ってしまいましたよ。",
							"translation": "他已經走掉了喔。"
						},
						{
							"sentence": "この小説はもう読んでしまったから、あげるね。",
							"translation": "這本小說我已經看完了，借給你吧。"
						}
					]
				},
				{
					"structure": "て形 + しまう",
					"explanation": "各種感嘆（遺憾、後悔、困擾等）",
					"example": [
						{
							"sentence": "電車の中にスマホを忘れてきてしまった。",
							"translation": "把手機忘在電車裡了。"
						},
						{
							"sentence": "その時、言ってはいけないことを言ってしまったと後悔しています。",
							"translation": "我很後悔當時講了不該講的話。"
						},
						{
							"sentence": "兄が買ったばかりの高級一眼レフを壊してしまいました。",
							"translation": "我不小心弄壞了哥哥才剛買的高級單眼相機。"
						},
						{
							"sentence": "亀が死んでしまいました。",
							"translation": "烏龜死掉了。"
						},
						{
							"sentence": "親に日記を見られてしまった。",
							"translation": "被父母看見日記了。"
						}
					],
					"note": [
						"以上的後悔都帶有「不小心做了某動作」的意思，而感到後悔、遺憾。"
					]
				},
				{
					"structure": "て形 + しまう",
					"explanation": "不由然的動作",
					"example": [
						{
							"sentence": "笑い事ではないのに笑ってしまった。",
							"translation": "明明沒有笑點卻忍不住笑了出來。"
						},
						{
							"sentence": "思わず泣いてしまった。",
							"translation": "不禁哭了。"
						}
					]
				}
			]
		},
		{
			"id": "N4-31",
			"name": " (よ)うとする・思う", 
			"translation": "表示意志",
			"level": "N4",
			"usage": [
				{
					"structure": "V(意量形) + (よ)う",
					"explanation": "表示「意志、推量、勸誘」等，中文上多譯為「～吧」",
					"example": [
						{
							"sentence": "行こう。",
							"translation": "走吧。"
						},
						{
							"sentence": "早く帰ろう。",
							"translation": "趕快回去吧。"
						},
						{
							"sentence": "食べよう。",
							"translation": "吃吧。"
						}
					]
				},
				{
					"structure": "V(意量形) + (よ)うとする",
					"explanation": "表動作正要發生之前的狀態，譯為「就要~、正想~、正準備要~」。經常和「と」「とき」「ところ」搭配。",
					"example": [
						{
							"sentence": "言おうとすると、忘れてしまいました。",
							"translation": "正要說就忘了。"
						},
						{
							"sentence": "出かけようとしたとき、友達が来ました。",
							"translation": "正要出門時朋友就來了。"
						},
						{
							"sentence": "勉強しようとすると眠くなる。",
							"translation": "要來念書的時候就變得想睡覺了。"
						},
						{
							"sentence": "寝ようとしたところに、電話がかかってきた。",
							"translation": "正要睡時電話響了。"
						}
					]
				},
				{
					"structure": "V(意量形) + (よ)うと思う",
					"explanation": "表打算做某動作，譯為「打算、想」",
					"example": [
						{
							"sentence": "日本に留学しようと思っています。",
							"translation": "我打算去日本留學。"
						},
						{
							"sentence": "今日からダイエットしようと思います。",
							"translation": "我打算從今天開始減肥。"
						},
						{
							"sentence": "彼は会社を辞めようと思っています。",
							"translation": "他打算離職。"
						}
					]
				}
			]
		},
		{
			"id": "N4-43",
			"name": "ようにする・ようになる", 
			"translation": "表示意志或推測",
			"level": "N4",
			"usage": [
				{
					"structure": "V4 + ようにする",
					"explanation": "為了達到前項內容而努力，是一種下決心要培養的習慣。",
					"example": [
						{
							"sentence": "今日から野菜も食べるようにする。",
							"translation": "從今天開始也吃青菜。"
						},
						{
							"sentence": "毎日、日本語のＴＶ番組を見るようにする。",
							"translation": "每天都要看日語的電視節目。"
						},
						{
							"sentence": "エレベーターがあっても、できるだけ階段を使うようにする。",
							"translation": "即使有電梯也盡可能走樓梯。"
						}
					],
					"note": [
						"如果是已經在進行的長期習慣則使用「V4 + ようにしている」的形式。"
					]
				},
				{
					"structure": "V4 + ようになる",
					"explanation": "表示動作上習慣性的自然演變，多為無能力到有能力的轉換表現。",
					"example": [
						{
							"sentence": "一歳を過ぎたので、もうすぐ歩けるようになるでしょう。",
							"translation": "已經一歲了，應該很快就會走路了吧？"
						},
						{
							"sentence": "爺ちゃんもやっとパソコンが使えるようになった。",
							"translation": "爺爺終於也會用電腦了。"
						},
						{
							"sentence": "毎日練習すれば、すぐに自転車に乗れるようになるでしょう。",
							"translation": "每天練習的話，很快就會騎腳踏車了吧。"
						}
					]
				}
			]
		},
		{
			"id": "N3-01",
			"name": "あがる／あげる", 
			"translation": "徹底完成",
			"level": "N3",
			"usage": [
				{
					"structure": "V2 + あがる 【自動詞】",
					"explanation": "表示某動作已經徹底完成了。由於是自動詞，所以是指物品已經完成的狀態。",
					"example": [
						{
							"sentence": "ピザが焼きあがりました。",
							"translation": "披薩烤好了。(自動詞)"
						},
						{
							"sentence": "洋服が仕上がりました。",
							"translation": "洋裝完成了。(自動詞)"
						},
						{
							"sentence": "原稿が書きあがりました。",
							"translation": "原稿寫好了。(自動詞)"
						}
					],
					"note": [
						"另外如果有注意到雨停的日文，常見的有「雨が止む」和「雨が上がる」，「雨が止んだ」是單純說雨停了，也許等等還會下(不知道)，但如果說「雨が上がった」就表示雨完全(徹底)停止了，已經是放晴的狀態。"
					]
				},
				{
					"structure": "V2 + あげる 【他動詞】",
					"explanation": "表示徹底完成某動作。由於是他動詞，所以是指某人已經完成的動作。",
					"example": [
						{
							"sentence": "ピザを焼きあげました。",
							"translation": "烤好披薩了。(他動詞)"
						},
						{
							"sentence": "洋服を仕上げました。",
							"translation": "完成洋裝了。(他動詞)"
						},
						{
							"sentence": "原稿を書きあげました。",
							"translation": "寫好原稿了。(他動詞)"
						}
					]
				}
			],
			"note": [
				"「あがる／あげる」具有徹底完成的意思，所以當烤好披薩時，講「焼きあがりました」會比「焼きました」更有完成的感覺。",
				"「V2あがる」、「V2あげる」可以寫作漢字的「V2上がる」、「V2上げる」。",
				"「仕上がる」、「出来上がる」、「完成する」等有微妙的差別，請參考此篇：「出来上がる」和「仕上げる」的差別"
			]
		},
		{
			"id": "N3-02",
			"name": "一方(だ)", 
			"translation": "不斷地",
			"level": "N3",
			"usage": [
				{
					"structure": "V4 (辭書形) + 一方(いっぽう)",
					"explanation": "表示事物朝某個方向持續發展，有傾向的意思，可用於正面或負面事物，但以負面消極例子居多。中譯為「不斷地~」、「越來越~」。",
					"example": [
						{
							"sentence": "スマホを使う人の数は増える一方だ。",
							"translation": "使用智慧型手機的人數不斷地增加。"
						},
						{
							"sentence": "原油価格は上がる一方だ。",
							"translation": "原油價格不斷地上漲。"
						},
						{
							"sentence": "国の国際競争力は低下する一方だ。",
							"translation": "國家的國際競爭力越來越低落。"
						}
					],
					"note": [
						"「～一方だ」≒「だんだん～ていく」≒「～ばかりだ」",
						"「一方」是名詞，後面接「だ」或「です」，如果是作為主語，其變化與形容動詞相同，如「低下する一方なのは問題です。」（持續低落是一個問題。）"
					]
				}
			]
		},
		{
			"id": "N3-03",
			"name": "うちに", 
			"translation": "在~過程中／趁~",
			"level": "N3",
			"usage": [
				{
					"structure": "V4／Vている／A4／NA4／(N+の) + うちに",
					"explanation": "表示在某個期間或時間內的持續狀態中，做了後項的動作。多譯為「在~之中、期間、過程中~」等。",
					"example": [
						{
							"sentence": "日本を旅するうちに、日本語を覚えた。",
							"translation": "在旅日期間學會了日語。"
						},
						{
							"sentence": "授業を聞いているうちに、眠ってしまった。",
							"translation": "上課上到一半不小心睡著了。"
						},
						{
							"sentence": "若いうちにいろんなことを経験しました。",
							"translation": "我在年輕時體驗過各種事情。"
						},
						{
							"sentence": "親が元気なうちに遺言書を書いてもらった。",
							"translation": "父母還健在時，我請他們先寫好遺書。"
						},
						{
							"sentence": "メイデイのコンサートは現地のファン５万人の歓声の中、大盛況のうちに終わった。",
							"translation": "五月天的演唱會在現場5萬人的歡呼聲中，盛大落幕。"
						}
					],
					"note": [
						"例句①的「旅する(たびする)」等同於「旅行する(りょこうする)」。「覚える」是「記得、學會」，它具有掌握、記憶的意思，多半屬於身體感受、或心裡感受所學到的事情，因此在日本旅遊過程中領會日語，就可以用「覚えた」。",
						"當前項為「ている」形式時，後面發生的動作多半是自然發生，而非自我意識。"
					]
				},
				{
					"structure": "V4／Vている／A4／NA4／(N+の) + うちに(趁~)",
					"explanation": "當句子非過去式時，「うちに」多半指「趁~之內」的意思。「~ないうちに」就是「趁還沒~的時候」之意。",
					"example": [
						{
							"sentence": "若いうちにいろんなことを経験したほうがいい。",
							"translation": "要趁年輕多體驗各種事情。"
						},
						{
							"sentence": "冷めないうちに食べてください。",
							"translation": "趁還沒冷掉趕快吃。"
						},
						{
							"sentence": "空模様が怪しくなってきたので、雨が降らないうちに、洗濯物を取り込もう。",
							"translation": "天空看起來快要下雨，趁下雨之前，趕快把洗好的衣服收進來吧。"
						}
					],
					"note": [
						"當「うちに」用於「趁~之內」的情況時，具有「把握短時間」的語感，因此時間長度比「あいだ」更短。「怪しい」原本是奇怪的意思，在這句「空模様が怪しい」則是指「天氣轉陰快要下雨」的意思。"
					]
				},
				{
					"structure": "V4／Vている／A4／NA4／(N+の) + うちは",
					"explanation": "「うちに」是具有限定的期間，有「趁~之內」完成之意。「うちは」只是提出該期間作為主詞，其動作可以為多次性，並沒有「趁~」的意思。",
					"example": [
						{
							"sentence": "雨が降らないうちに、早く帰ったほうがいい。",
							"translation": "趁還沒下雨趕快回家比較好。"
						},
						{
							"sentence": "雨が降っているうちは、ずっと勉強しています。",
							"translation": "在下雨的這段時間內，我一直在看書。"
						}
					]
				}
			]
		},
		{
			"id": "N3-04",
			"name": "おかげで", 
			"translation": "多虧、幸虧",
			"level": "N3",
			"usage": [
				{
					"structure": "(Vた／A4／NA4／N+の)+おかげで",
					"explanation": "表示承蒙前項恩惠才有後項的好結果，語氣中帶有感謝之意，中譯為「多虧、幸虧」。此用法亦可用在負面事物上，帶有諷刺意味，如「拜某人所賜才有此惡果」。「おかげで」的「で」具有原因理由之意，若放置句尾時則用「です／だ」即可。另外還有一個常見的詞彙：「お陰様で（おかげさまで）」，中文為「托您的福」。",
					"example": [
						{
							"sentence": "このサイトを続けられたのは、みんなが応援してくれたおかげです。",
							"translation": "多虧大家的支持這個網站才能持續下去。"
						},
						{
							"sentence": "競争相手が少ないおかげで、勝てる確率が高くなる。",
							"translation": "幸虧競爭對手很少才讓勝率提高。"
						},
						{
							"sentence": "家にいる20歳の猫は、体が丈夫なおかげで、寒い雪の夜を無事に過ごすことができた。",
							"translation": "家裡20歲的貓幸虧身體勇健才能在寒冷的雪夜裡平安度過。"
						},
						{
							"sentence": "薬のおかげで8時間眠れるようになりました。",
							"translation": "多虧藥效讓我能睡足8個小時了。"
						},
						{
							"sentence": "お陰様で、元気です。",
							"translation": "托您的福，我很好。"
						}
					]
				}
			]
		},
		{
			"id": "N3-05",
			"name": "恐れがある", 
			"translation": "恐怕、恐有",
			"level": "N3",
			"usage": [
				{
					"structure": "（V4／N + の）おそれがある",
					"explanation": "表示推測可能會發生不好的事情，只用於負面推測，多用於新聞播報。中譯為「恐怕」、「有~的危險」。相當於「危険がある」。",
					"example": [
						{
							"sentence": "治療が遅れると感染を広げる恐れがある。",
							"translation": "若延遲治療恐怕感染會擴大。"
						},
						{
							"sentence": "このまま雪が続けば、住民の生活に大きな影響が出る恐れがある。",
							"translation": "若再這樣持續下雪的話，恐怕會對住民的生活造成很大的影響。"
						},
						{
							"sentence": "交通省は震度５強の地震で倒壊の恐れがある建物が1400棟に上がることを明らかにした。",
							"translation": "交通部表明可能受五級地震倒塌的建築物高達1400棟。"
						},
						{
							"sentence": "台風や大雨などによる災害の恐れがある。",
							"translation": "恐因颱風或大雨造成災害。"
						}
					]
				}
			]
		},
		{
			"id": "N3-06",
			"name": "かえって", 
			"translation": "反倒、反而",
			"level": "N3",
			"usage": [
				{
					"structure": "かえって（副詞）",
					"explanation": "表示發生的事情跟自己預想的結果相違背，而自己的預想通常也符合一般性的認知，也就是說「眾所認知應該會發生A，卻發生了與A不同的B」，中譯為「反倒、反而」",
					"example": [
						{
							"sentence": "中国語が上達するように台湾へ行ったが、かえって英語を教えるようになってしまいました。",
							"translation": "為了讓中文進步而去台灣，沒想到反而變成去那邊教英文了。"
						},
						{
							"sentence": "間に合うように思って車で行ったが、渋滞のせいでかえって遅くなってしまいました。",
							"translation": "為了趕上所以開車前往，哪知道反而因塞車而遲到了。"
						},
						{
							"sentence": "理解してもらえるように説明したつもりなんだけど、かえって「言い訳をするな」と叱られた。",
							"translation": "原本只是希望對方能理解而做說明，反倒被罵不可找藉口。"
						}
					],
					"note": [
						"學習上的「進步」，日文可以用「～が上達する」或「～が上手になる」等表現，不是「進歩（しんぽ）」，「進歩（しんぽ）」是指文明或科學的那種進步，如「科学技術が進歩した」。",
						"使用本文法時請寫假名「かえって」，不寫「帰って、返って、還って」等漢字，漢字皆各有其他意思，與本文法不同。"
					]
				}
			]
		},
		{
			"id": "N3-07",
			"name": "かけ", 
			"translation": "剛做一半",
			"level": "N3",
			"usage": [
				{
					"structure": "V2+かけ",
					"explanation": "表示動作或狀態正進行到一半，雖然跟「ている」形式相似，但「かけ」有一種【尚未完】的語感。中譯為「剛做一半」。",
					"example": [
						{
							"sentence": "ご飯食べかけで出掛ける。",
							"translation": "飯才剛吃一半就出門了。"
						},
						{
							"sentence": "やりかけの仕事を諦めてはいけません！",
							"translation": "不可以放棄才剛做到一半的工作。"
						},
						{
							"sentence": "この「万葉集」はまだ読みかけだったが、生徒が読みたいと言うので貸した。",
							"translation": "這本「萬葉集」才剛看了一半，但學生想看就借給他了。"
						}
					],
					"note": [
						"以上的「V2かけ」屬於名詞(動詞名詞化)，所以後面多半接「で、の」等，但也有「V2かける」的用法，這時則改為「て或た」，要看句子內容決定。"
					]
				},
				{
					"structure": "V2+かけ",
					"explanation": "「かけ」通常是「剛開始做，而做到一半」的狀態，所以也包含「剛開始」的意味，當用於「物體本身的狀態」時，視情況也有「快要」的意思。",
					"example": [
						{
							"sentence": "ご飯を食べかけた時、電話が鳴った。",
							"translation": "才剛開始吃飯電話就響了。"
						},
						{
							"sentence": "腐りかけのパンを食べたくない。",
							"translation": "我不想吃快要發霉的麵包。"
						}
					],
					"note": [
						"例子②「腐りかけ」就是說「腐る」這個動作已經開始，只是剛開始，還沒到完全「腐った」的地步，比如說麵包上只有1、2個黑點(動作開始了)，還沒到「腐壞」的程度。換個例子「壊れかけの携帯」就是「快要壞了的手機」(其中\"壊れる\"這個動作已經開始但還不到「壊れた」的地步)，比如說手機壞掉之前可能是電池耗電或操作LAG等。"
					]
				}
			]
		},
		{
			"id": "N3-08",
			"name": "がち", 
			"translation": "容易／傾向",
			"level": "N3",
			"usage": [
				{
					"structure": "V2 + がち",
					"explanation": "表示即使是在無意之中也容易發生的動作，多用於負面事物，譯為「容易~」、「往往~」、「總是~」、「經常會~」等等。漢字可寫作「勝ち」，但多半會寫平假名。",
					"example": [
						{
							"sentence": "会社を休みがちな人だ。",
							"translation": "動不動就向公司請假的人。"
						},
						{
							"sentence": "家に引き籠りがちな不登校生徒を家庭訪問する。",
							"translation": "對閉門不出(傾向)的中輟生進行家庭訪問。"
						},
						{
							"sentence": "私は人の名前を忘れがちです。",
							"translation": "我容易(往往)忘記人的名字。"
						}
					],
					"note": [
						"以上都是指「容易~」「往往~」等，表示該動詞具有〇〇傾向且經常發生或是容易發生，可視為「動不動就~」之意，而這些動作通常也是人可以控制的範圍。如果是用在非人為可以控制的範圍，多半採用名詞形式，其意思為「帶有〇〇的傾向」，如「多雲（曇りがち）、多雨（雨がち）」。"
					]
				}
			]
		},
		{
			"id": "N3-09",
			"name": "か何か", 
			"translation": "什麼之類的",
			"level": "N3",
			"usage": [
				{
					"structure": "N／V + か何か（かなにか）",
					"explanation": "表示列舉非明確之事物來指出該事項，口語可說成「～かなんか」，中譯為「什麼之類的」",
					"example": [
						{
							"sentence": "コーヒーか何か飲みませんか。",
							"translation": "要不要喝點咖啡什麼的？"
						},
						{
							"sentence": "変な音がしたけど、たぶん猫か何かだろう。",
							"translation": "我好像聽到奇怪的聲音，應該是貓什麼的吧。"
						},
						{
							"sentence": "絵か何か部屋を飾りたいです。",
							"translation": "想在房間裝飾一些畫之類的。"
						}
					],
					"note": [
						"例子①可能會覺得跟「コーヒーでも飲みませんか」很相似，不過有些微妙的差異。「コーヒーか何か飲みませんか」的意思是「要不要喝東西？比如說咖啡或者是其他什麼的」，這裡說的「其他什麼的」大多跟前面舉的例子相近，如「コーヒーのような飲み物」，或是例子②的「猫のような動物」、例子③的「絵のような飾り物」等。我會提出這個是因為還有一個文法也滿類似的，即「コーヒーや何か飲みませんか」，這時候就是指「咖啡」或是「咖啡以外的東西」，沒有「〇〇のような～」的含意，而是指「咖啡」或是「除了咖啡之外其他的東西」。而「コーヒーでも飲みませんか」嚴格說起來只是「委婉的舉例」，也就是說對方就是問你要不要喝咖啡，但如果直接說「コーヒーを飲みませんか」就沒有選擇的餘地，感覺比較強硬一點，所以通常會委婉地說「コーヒーでも飲みませんか」。"
					]
				}
			]
		},
		{
			"id": "N3-10",
			"name": "かもしれない", 
			"translation": "也許、可能",
			"level": "N3",
			"usage": [
				{
					"structure": "(V/A/N/Na) + かもしれない",
					"explanation": "表示對某事物之推測，其發生的可能性較小，說話者多半也沒太大把握。此用法也經常用於婉轉陳述自己的看法，避免口氣太強硬，跟可能性大小較無關係。中譯為「也許、可能」，口語可略縮為「かも」。",
					"example": [
						{
							"sentence": "今晩は会社の忘年会で帰るのが遅くなるかもしれない。",
							"translation": "今天晚上公司有年終聚餐(尾牙)，可能會晚一點回來。"
						},
						{
							"sentence": "この商品は安いかもしれないが、品質が保証できない。",
							"translation": "這件商品也許是便宜了些，但品質無法保證。"
						},
						{
							"sentence": "殺人犯は通報した先生かもしれない。",
							"translation": "殺人犯可能就是報警的老師。"
						}
					],
					"note": [
						"如果是用更為口語的「かも」，須置於句尾。「かも」是更為口語的常體表現，是跟朋友或晚輩談話才會使用，丁寧體則是「かもしれません」"
					]
				}
			]
		},
		{
			"id": "N3-11",
			"name": "～から～にかけて", 
			"translation": "從~到~",
			"level": "N3",
			"usage": [
				{
					"structure": "N から N にかけて",
					"explanation": "表示兩個「場所」或「時間」之間的大略範圍，中譯為「從~到~」。跟「~から~まで」不同的是，「～から～にかけて」並沒有明確劃出界線，只是籠統地指出其範圍。而「～から～まで」則是明確道出「起點」跟「終點」。",
					"example": [
						{
							"sentence": "明日から明後日にかけて超大型の台風が来ます。",
							"translation": "超大型颱風將於明天到後天之間登陸。 "
						},
						{
							"sentence": "北部から中部にかけて大雪となっています。",
							"translation": "從北部到中部下起了大雪。"
						},
						{
							"sentence": "来週にかけて気温がさらに下がりそうです。",
							"translation": "氣溫好像會進一步下降到下禮拜。"
						}
					],
					"note": [
						"本項用法可以省略「から」，如例句③。"
					]
				}
			]
		},
		{
			"id": "N3-70",
			"name": "とたん（に）", 
			"translation": "剎那、瞬間",
			"level": "N3",
			"usage": [
				{
					"structure": "V2 + た + とたん（に）",
					"explanation": "用於動詞過去式，表示某動作發生後的瞬間緊接著發生後面的動作，多帶有意外性。漢字為「途端（とたん）」，後面的「に」可省略，中譯多為「剎那」、「瞬間」、「一~就~」等。",
					"example": [
						{
							"sentence": "電気が切れたとたんに、幽霊が現れた。",
							"translation": "電燈熄滅的剎那，鬼就出現了。"
						},
						{
							"sentence": "テレビをつけたとたん、停電になった",
							"translation": "打開電視的一剎那突然停電了。"
						},
						{
							"sentence": "家を出たとたん、私のバイクの上に野良猫が寝ている姿を見た。",
							"translation": "一出家門就看到一隻流浪貓在我機車上睡覺。"
						}
					],
					"note": [
						"「とたん」表示前項動作與後項動作（或發現）幾乎是同時發生，也就是說前項動作發生的極短瞬間內馬上發生後項動作（或發現後項事情）。",
						"「とたん」一般不用於說話者的意志動作上。由於「とたん」多半帶有意外性，而說話者的意志動作屬於自己的意志（也就是說自己要做的動作不會有意外性），因此不太會用「とたん」，意志動作多半用「～と+すぐに」來表達。"
					]
				}
			]
		}
	]
}